#include "FBAttrs.h"

const std::string _KN_ = "###KN_PLACE_HOLDER###";
const std::string _NM_ = "###NM_PLACE_HOLDER###";

// SOHFURI
const FBAttrsArray ATTRS_ARRAY_SOHFURI =
{
    //HEADER RECORD
    FBAttrs
    {
        { 0,   0,  1, 'N', "1",  'M', "L1", "データ区分",   "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：ヘッダーレコード"},
        { 1,   1,  2, 'N', _NM_, 'M', _NM_, "種別コード",   "属性：Ｎ（２）　  \r\n必須項目\r\n「２１」：総合振込"},
        { 2,   3,  1, 'N', _NM_, 'M', _NM_, "コード区分",   "属性：Ｎ（１）　  \r\n必須項目\r\n「０」：ＳＪＩＳ\r\n「１」：ＥＢＣＤＩＣ"},
        { 3,   4, 10, 'N', _NM_, 'M', _NM_, "依頼人コード", "属性：Ｎ（１０）  \r\n必須項目\r\n振込依頼人識別のため銀行が採番したコード"},
        { 4,  14, 40, 'C', _KN_, 'M', _KN_, "依頼人名",     "属性：Ｃ（４０）  \r\n必須項目\r\n"},
        { 5,  54,  4, 'N', _NM_, 'M', _NM_, "取組日",       "属性：Ｎ（４）　  \r\n必須項目\r\nＭＭＤＤ（ＭＭ月ＤＤ日）"},
        { 6,  58,  4, 'N', _NM_, 'M', _NM_, "仕向銀行番号", "属性：Ｎ（４）　  \r\n必須項目\r\n統一金融機関番号"},
        { 7,  62, 15, 'C', _KN_, 'O', _KN_, "仕向銀行名",   "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 8,  77,  3, 'N', _NM_, 'M', _NM_, "仕向支店番号", "属性：Ｎ（３）　  \r\n必須項目\r\n統一店番号"},
        { 9,  80, 15, 'C', _KN_, 'O', _KN_, "仕向支店名",   "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        {10,  95,  1, 'N', _NM_, 'O', _NM_, "預金種目",     "属性：Ｎ（１）　  \r\n任意項目\r\n「１」：普通預金\r\n「２」：当座預金\r\n「９」：その他"},
        {11,  96,  7, 'N', _NM_, 'O', _NM_, "口座番号",     "属性：Ｎ（７）　  \r\n任意項目\r\n"},
        {12, 103, 17, 'C', " ",  'O', "R ", "ダミー",       "属性：Ｃ（１７）  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //DATA RECORD
    FBAttrs
    {
        { 0,   0,  1, 'N', "2",  'M', "L2", "データ区分",     "属性：Ｎ（１）　  \r\n必須項目\r\n「２」：データーレコード"},
        { 1,   1,  4, 'N', _NM_, 'M', _NM_, "銀行番号",       "属性：Ｎ（４）　  \r\n必須項目\r\n統一金融機関番号"},
        { 2,   5, 15, 'C', _KN_, 'O', _KN_, "銀行名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 3,  20,  3, 'N', _NM_, 'M', _NM_, "支店番号",       "属性：Ｎ（３）　  \r\n必須項目\r\n統一店番号"},
        { 4,  23, 15, 'C', _KN_, 'O', _KN_, "支店名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 5,  38,  4, 'N', _NM_, 'O', _NM_, "手形交換所番号", "属性：Ｎ（４）　  \r\n任意項目\r\n統一手形交換所番号"},
        { 6,  42,  1, 'N', _NM_, 'M', _NM_, "預金種目",       "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：普通預金\r\n「２」：当座預金\r\n「４」：貯蓄預金\r\n「９」：その他"},
        { 7,  43,  7, 'N', _NM_, 'M', _NM_, "口座番号",       "属性：Ｎ（７）　  \r\n必須項目\r\n"},
        { 8,  50, 30, 'C', _KN_, 'M', _KN_, "受取人名",       "属性：Ｃ（３０）  \r\n必須項目\r\n"},
        { 9,  80, 10, 'N', _NM_, 'M', _NM_, "振込金額",       "属性：Ｎ（１０）  \r\n必須項目\r\n"},
        {10,  90,  1, 'N', _NM_, 'M', _NM_, "新規コード",     "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：第１回振込分\r\n「２」：変更分（銀行・支店、預金種目・口座番号）\r\n「０」：その他"},
        {11,  91, 10, 'N', _KN_, 'O', _KN_, "顧客コード1",    "属性：Ｎ（１０）  \r\n任意項目\r\n依頼人が定めた受取人識別のための顧客コード"},
        {12, 101, 10, 'N', _KN_, 'O', _KN_, "顧客コード2",    "属性：Ｎ（１０）  \r\n任意項目\r\n依頼人が定めた受取人識別のための顧客コード"},
        {13, 111,  1, 'N', _NM_, 'O', _NM_, "振込区分",       "属性：Ｎ（１）　  \r\n任意項目\r\n「７」：テレ振込\r\n「８」：文書振込"},
        {14, 112,  1, 'C', _KN_, 'O', _KN_, "識別表示",       "属性：Ｃ（１）　  \r\n任意項目\r\n「Ｙ」またはスペース\r\n「Ｙ」の場合、「顧客コード１」「顧客コード２」は「EDI情報」となる"},
        {15, 113,  7, 'C', " ",  'O', "R ", "ダミー",         "属性：Ｃ（７）　  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //TRAILER RECORD
    FBAttrs
    {
        { 0,  0,   1, 'N', "8",  'M', "L8", "データ区分", "属性：Ｎ（１）　   \r\n必須項目\r\n「８」：トレーラーレコード"},
        { 1,  1,   6, 'N', _NM_, 'M', _NM_, "合計件数",   "属性：Ｎ（６）     \r\n必須項目\r\n"},
        { 2,  7,  12, 'N', _NM_, 'M', _NM_, "合計金額",   "属性：Ｎ（１２）　 \r\n必須項目\r\n"},
        { 3, 19, 101, 'C', " ",  'O', "R ", "ダミー",     "属性：Ｃ（１０１） \r\n必須項目\r\nスペースとする"}
    }
    ,

    //END RECORD
    FBAttrs
    {
        { 0, 0,   1, 'N', "9", 'M', "L9", "データ区分", "属性：Ｎ（１）     \r\n必須項目\r\n「９」：エンドレコード"},
        { 1, 1, 119, 'C', " ", 'O', "R ", "ダミー",     "属性：Ｃ（１１９） \r\n必須項目\r\nスペースとする"}
    }
};

//KYUYO_SHOYO
const FBAttrsArray ATTRS_ARRAY_KYUYO_SHOYO =
{
    //HEADER RECORD
    FBAttrs
    {
        { 0,   0,  1, 'N', "1",  'M', "L1", "データ区分",         "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：ヘッダーレコード"},
        { 1,   1,  2, 'N', _NM_, 'M', _NM_, "種別コード",         "属性：Ｎ（２）　  \r\n必須項目\r\n「１１」：給与振込（民間）\r\n「１２」：給与振込（民間）\r\n「７１」：給与振込（地方公務員）\r\n「７２」：賞与振込（地方公務員）"},
        { 2,   3,  1, 'N', _NM_, 'M', _NM_, "コード区分",         "属性：Ｎ（１）　  \r\n必須項目\r\n「０」：ＳＪＩＳ\r\n「１」：ＥＢＣＤＩＣ"},
        { 3,   4, 10, 'N', _NM_, 'M', _NM_, "会社コード",         "属性：Ｎ（１０）  \r\n必須項目\r\n銀行が採番した取引先の会社コード"},
        { 4,  14, 40, 'C', _KN_, 'M', _KN_, "会社名",             "属性：Ｃ（４０）  \r\n必須項目\r\n"},
        { 5,  54,  4, 'N', _NM_, 'M', _NM_, "振込指定日",         "属性：Ｎ（４）　  \r\n必須項目\r\nＭＭＤＤ（ＭＭ月ＤＤ日）"},
        { 6,  58,  4, 'N', _NM_, 'M', _NM_, "仕向銀行番号",       "属性：Ｎ（４）　  \r\n必須項目\r\n統一金融機関番号"},
        { 7,  62, 15, 'C', _KN_, 'O', _KN_, "仕向銀行名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 8,  77,  3, 'N', _NM_, 'M', _NM_, "仕向支店番号",       "属性：Ｎ（３）　  \r\n必須項目\r\n統一店番号"},
        { 9,  80, 15, 'C', _KN_, 'O', _KN_, "仕向支店名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        {10,  95,  1, 'N', _NM_, 'O', _NM_, "預金種目（企業等）", "属性：Ｎ（１）　  \r\n任意項目\r\n「１」：普通預金\r\n「２」：当座預金"},
        {11,  96,  7, 'N', _NM_, 'O', _NM_, "口座番号（企業等）", "属性：Ｎ（７）　  \r\n任意項目\r\n"},
        {12, 103, 17, 'C', " ",  'O', "R ", "ダミー",             "属性：Ｃ（１７）  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //DATA RECORD
    FBAttrs
    {
        { 0,   0,  1, 'N', "2",  'M', "L2", "データ区分",     "属性：Ｎ（１）　  \r\n必須項目\r\n「２」：データーレコード"},
        { 1,   1,  4, 'N', _NM_, 'M', _NM_, "銀行番号",       "属性：Ｎ（４）　  \r\n必須項目\r\n統一金融機関番号"},
        { 2,   5, 15, 'C', _KN_, 'M', _KN_, "銀行名",         "属性：Ｃ（１５）  \r\n必須項目"},
        { 3,  20,  3, 'N', _NM_, 'M', _NM_, "支店番号",       "属性：Ｎ（３）　  \r\n必須項目\r\n統一店番号"},
        { 4,  23, 15, 'C', _KN_, 'M', _KN_, "支店名",         "属性：Ｃ（１５）  \r\n必須項目"},
        { 5,  38,  4, 'N', _NM_, 'O', _NM_, "手形交換所番号", "属性：Ｎ（４）　  \r\n任意項目\r\n統一手形交換所番号"},
        { 6,  42,  1, 'N', _NM_, 'M', _NM_, "預金種目",       "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：普通預金\r\n「２」：当座預金"},
        { 7,  43,  7, 'N', _NM_, 'M', _NM_, "口座番号",       "属性：Ｎ（７）　  \r\n必須項目"},
        { 8,  50, 30, 'C', _KN_, 'M', _KN_, "預金者名",       "属性：Ｃ（３０）  \r\n必須項目"},
        { 9,  80, 10, 'N', _NM_, 'M', _NM_, "振込金額",       "属性：Ｎ（１０）  \r\n必須項目"},
        {10,  90,  1, 'N', _NM_, 'M', _NM_, "新規コード",     "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：第１回振込分\r\n「２」：変更分（銀行・支店、預金種目・口座番号）\r\n「０」：その他"},
        {11,  91, 10, 'N', _NM_, 'O', _NM_, "社員番号",       "属性：Ｎ（１０）  \r\n任意項目\r\n企業等での社員番号"},
        {12, 101, 10, 'N', _NM_, 'O', _NM_, "所属コード",     "属性：Ｎ（１０）  \r\n任意項目\r\n企業等での所属コード"},
        {13, 111,  9, 'C', " ",  'O', "R ", "ダミー",         "属性：Ｃ（９）　  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //TRAILER RECORD
    FBAttrs
    {
        { 0,  0,   1, 'N', "8",  'M', "L8", "データ区分", "属性：Ｎ（１）　   \r\n必須項目\r\n「８」：トレーラーレコード"},
        { 1,  1,   6, 'N', _NM_, 'M', _NM_, "合計件数",   "属性：Ｎ（６）　   \r\n必須項目\r\n"},
        { 2,  7,  12, 'N', _NM_, 'M', _NM_, "合計金額",   "属性：Ｎ（１２）　 \r\n必須項目\r\n"},
        { 3, 19, 101, 'C', " ",  'O', "R ", "ダミー",     "属性：Ｃ（１０１） \r\n必須項目\r\nスペースとする"}
    }
    ,

    //END RECORD
    FBAttrs
    {
        { 0, 0,   1, 'N', "9", 'M', "L9", "データ区分", "属性：Ｎ（１）     \r\n必須項目\r\n「９」：エンドレコード"},
        { 1, 1, 119, 'C', " ", 'O', "R ", "ダミー",     "属性：Ｃ（１１９） \r\n必須項目\r\nスペースとする"}
    }
};

//FURIKAE
const FBAttrsArray ATTRS_ARRAY_FURIKAE =
{
    //HEADER RECORD
    FBAttrs
    {
        { 0,   0,  1, 'N', "1",  'M', "L1", "データ区分",         "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：ヘッダーレコード"},
        { 1,   1,  2, 'N', _NM_, 'M', _NM_, "種別コード",         "属性：Ｎ（２）　  \r\n必須項目\r\n「９１」：預金口座振替"},
        { 2,   3,  1, 'N', _NM_, 'M', _NM_, "コード区分",         "属性：Ｎ（１）　  \r\n必須項目\r\n「０」：ＳＪＩＳ\r\n「１」：ＥＢＣＤＩＣ\r\nその他のコードについては全銀協基準による"},
        { 3,   4, 10, 'N', _NM_, 'M', _NM_, "委託者コード",       "属性：Ｎ（１０）  \r\n必須項目\r\n銀行が定めた委託者のコード"},
        { 4,  14, 40, 'C', _KN_, 'M', _KN_, "委託者名",           "属性：Ｃ（４０）  \r\n必須項目\r\n"},
        { 5,  54,  4, 'N', _NM_, 'M', _NM_, "引落日",             "属性：Ｎ（４）　  \r\n必須項目\r\nＭＭＤＤ（ＭＭ月ＤＤ日）"},
        { 6,  58,  4, 'N', _NM_, 'M', _NM_, "取引銀行番号",       "属性：Ｎ（４）　  \r\n必須項目\r\n統一金融機関番号"},
        { 7,  62, 15, 'C', _KN_, 'O', _KN_, "取引銀行名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 8,  77,  3, 'N', _NM_, 'M', _NM_, "取引支店番号",       "属性：Ｎ（３）　  \r\n必須項目\r\n統一店番号"},
        { 9,  80, 15, 'C', _KN_, 'O', _KN_, "取引支店名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        {10,  95,  1, 'N', _NM_, 'M', _NM_, "預金種目（委託者）", "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：普通預金\r\n「２」：当座預金\r\n「９」：その他"},
        {11,  96,  7, 'N', _NM_, 'M', _NM_, "口座番号（委託者）", "属性：Ｎ（７）　  \r\n必須項目\r\n"},
        {12, 103, 17, 'C', " ",  'O', "R ", "ダミー",             "属性：Ｃ（１７）  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //DATA RECORD
    FBAttrs
    {
        { 0,   0,  1, 'N', "2",  'M', "L2", "データ区分",     "属性：Ｎ（１）　  \r\n必須項目\r\n「２」：データーレコード"},
        { 1,   1,  4, 'N', _NM_, 'M', _NM_, "銀行番号",       "属性：Ｎ（４）　  \r\n必須項目\r\n統一金融機関番号"},
        { 2,   5, 15, 'C', _KN_, 'O', _KN_, "銀行名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 3,  20,  3, 'N', _NM_, 'M', _NM_, "支店番号",       "属性：Ｎ（３）　  \r\n必須項目\r\n統一店番号"},
        { 4,  23, 15, 'C', _KN_, 'O', _KN_, "支店名",         "属性：Ｃ（１５）  \r\n任意項目\r\n"},
        { 5,  38,  4, 'D', " ",  'O', "R ", "ダミー",         "属性：Ｃ（４）　  \r\n必須項目\r\nスペースとする"},
        { 6,  42,  1, 'N', _NM_, 'M', _NM_, "預金種目",       "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：普通預金\r\n「２」：当座預金\r\n「３」：納税準備預金\r\n「９」：その他"},
        { 7,  43,  7, 'N', _NM_, 'M', _NM_, "口座番号",       "属性：Ｎ（７）　  \r\n必須項目\r\n"},
        { 8,  50, 30, 'C', _KN_, 'M', _KN_, "預金者名",       "属性：Ｃ（３０）  \r\n必須項目\r\n"},
        { 9,  80, 10, 'N', _NM_, 'M', _NM_, "引落金額",       "属性：Ｎ（１０）  \r\n必須項目\r\n"},
        {10,  90,  1, 'N', _NM_, 'M', _NM_, "新規コード",     "属性：Ｎ（１）　  \r\n必須項目\r\n「１」：第１回引落分\r\n「２」：変更分（銀行・支店・口座番号）\r\n「０」：その他"},
        {11,  91, 20, 'N', _NM_, 'M', _NM_, "顧客番号",       "属性：Ｎ（２０）  \r\n必須項目\r\n委託者が定めた顧客番号"},
        {12, 111,  1, 'N', _NM_, 'M', _NM_, "振替結果コード", "属性：Ｎ（１）　  \r\n必須項目\r\n振替処理を行った結果\r\n依頼明細では「０」とする"},
        {13, 112,  8, 'C', " ",  'O', "R ", "ダミー",         "属性：Ｃ（８）　  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //TRAILER RECORD
    FBAttrs
    {
        { 0,  0,   1, 'N', "8",  'M', "L8", "データ区分",   "文字属性：Ｎ（１）　  \r\n必須項目\r\n「８」：トレーラーレコード"},
        { 1,  1,   6, 'N', _NM_, 'M', _NM_, "合計件数",     "文字属性：Ｎ（６）　  \r\n必須項目\r\n"},
        { 2,  7,  12, 'N', _NM_, 'M', _NM_, "合計金額",     "文字属性：Ｎ（１２）  \r\n必須項目\r\n"},
        { 3, 19,   6, 'N', _NM_, 'M', _NM_, "振替済件数",   "文字属性：Ｎ（６）　  \r\n必須項目\r\n依頼明細では全て「０」とする"},
        { 4, 25,  12, 'N', _NM_, 'M', _NM_, "振替済金額",   "文字属性：Ｎ（１２）  \r\n必須項目\r\n依頼明細では全て「０」とする"},
        { 5, 37,   6, 'N', _NM_, 'M', _NM_, "振替不能件数", "文字属性：Ｎ（６）　  \r\n必須項目\r\n依頼明細では全て「０」とする"},
        { 6, 43,  12, 'N', _NM_, 'M', _NM_, "振替不能金額", "文字属性：Ｎ（１２）  \r\n必須項目\r\n依頼明細では全て「０」とする"},
        { 7, 55,  65, 'C', " ",  'O', "R ", "ダミー",       "文字属性：Ｃ（５５）  \r\n必須項目\r\nスペースとする"}
    }
    ,

    //END RECORD
    FBAttrs
    {
        { 0, 0,   1, 'N', "9", 'M', "L9", "データ区分", "文字属性：Ｎ（１）     \r\n必須項目\r\n「９」：エンドレコード"},
        { 1, 1, 119, 'C', " ", 'O', "R ", "ダミー",     "文字属性：Ｃ（１１９） \r\n必須項目\r\nスペースとする"}
    }
};

const std::string chars_kana_default   = " ()-.0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZｱｲｳｴｵｶｷｸｹｺｻｼｽｾｿﾀﾁﾂﾃﾄﾅﾆﾇﾈﾉﾊﾋﾌﾍﾎﾏﾐﾑﾒﾓﾔﾕﾖﾗﾘﾙﾚﾛﾜｦﾝﾞﾟ";
const std::string padding_kana_default = "R ";

const std::string chars_num_default    = "0123456789";
const std::string padding_num_default  = "L0";

FBAttrsArray make_attrs_array
(
    FBType type,
    std::string chars_kana,
    std::string padding_kana,
    std::string chars_num,
    std::string padding_num   
)
{
    FBAttrsArray attrs_array;

    switch(type)
    {
        case FBType::SOHFURI:
            attrs_array = ATTRS_ARRAY_SOHFURI;          
            break;

        case FBType::KYUYO_SHOYO:
            attrs_array = ATTRS_ARRAY_KYUYO_SHOYO;  
            break;

        case FBType::FURIKAE:
            attrs_array = ATTRS_ARRAY_FURIKAE;  
            break;

        default:
            attrs_array = ATTRS_ARRAY_SOHFURI;          
            break;
    }
    

    if(chars_kana.empty()  ){ chars_kana   = chars_kana_default;   }
    if(padding_kana.empty()){ padding_kana = padding_kana_default; }
    if(chars_num.empty()   ){ chars_num    = chars_num_default;    }
    if(padding_num.empty() ){ padding_num  = padding_num_default;  }

    for(auto& attrs : attrs_array)
    {
        for(auto& attr : attrs)
        {
            if(attr.char_includes == _KN_){ attr.char_includes = chars_kana;   }
            if(attr.padding_conf  == _KN_){ attr.padding_conf  = padding_kana; }
            if(attr.char_includes == _NM_){ attr.char_includes = chars_num;    }
            if(attr.padding_conf  == _NM_){ attr.padding_conf  = padding_num;  }
        }
        
    }

    return attrs_array;
}